<?php

namespace App\Helpers;

use Illuminate\Support\Arr;

if (!class_exists('CodesSubjects')) {
    class CodesSubjects
    {
        private array $regions = [
            1 => "Республика Адыгея",
            2 => "Республика Башкортостан",
            3 => "Республика Бурятия",
            4 => "Республика Алтай",
            5 => "Республика Дагестан",
            6 => "Республика Ингушетия",
            7 => "Кабардино-Балкарская Республика",
            8 => "Республика Калмыкия",
            9 => "Карачаево-Черкесская Республика",
            10 => "Республика Карелия",
            11 => "Республика Коми",
            12 => "Республика Марий Эл",
            13 => "Республика Мордовия",
            14 => "Республика Саха [Якутия]",
            15 => "Северная Осетия",
            16 => "Республика Татарстан",
            17 => "Республика Тыва",
            18 => "Удмуртская Республика",
            19 => "Республика Хакасия",
            20 => "Чеченская Республика",
            21 => "Чувашская Республика",
            22 => "Алтайский край",
            23 => "Краснодарский край",
            24 => "Красноярский край",
            25 => "Приморский край",
            26 => "Ставропольский край",
            27 => "Хабаровский край",
            28 => "Амурская область",
            29 => "Архангельская область",
            30 => "Астраханская область",
            31 => "Белгородская область",
            32 => "Брянская область",
            33 => "Владимирская область",
            34 => "Волгоградская область",
            35 => "Вологодская область",
            36 => "Воронежская область",
            37 => "Ивановская область",
            38 => "Иркутская область",
            39 => "Калининградская область",
            40 => "Калужская область",
            41 => "Камчатский край",
            42 => "Кемеровская область",
            43 => "Кировская область",
            44 => "Костромская область",
            45 => "Курганская область",
            46 => "Курская область",
            47 => "Ленинградская область",
            48 => "Липецкая область",
            49 => "Магаданская область",
            50 => "Московская область",
            51 => "Мурманская область",
            52 => "Нижегородская область",
            53 => "Новгородская область",
            54 => "Новосибирская область",
            55 => "Омская область",
            56 => "Оренбургская область",
            57 => "Орловская область",
            58 => "Пензенская область",
            59 => "Пермский край",
            60 => "Псковская область",
            61 => "Ростовская область",
            62 => "Рязанская область",
            63 => "Самарская область",
            64 => "Саратовская область",
            65 => "Сахалинская область",
            66 => "Свердловская область",
            67 => "Смоленская область",
            68 => "Тамбовская область",
            69 => "Тверская область",
            70 => "Томская область",
            71 => "Тульская область",
            72 => "Тюменская область",
            73 => "Ульяновская область",
            74 => "Челябинская область",
            75 => "Забайкальский край",
            76 => "Ярославская область",
            77 => "Москва",
            78 => "Санкт-Петербург",
            79 => "Еврейская авт. область",
            83 => "Ненецкий автономный округ",
            86 => "Ханты-Мансийский автономный округ",
            87 => "Чукотский автономный округ",
            89 => "Ямало-Ненецкий автономный округ",
            90 => "Запорожская область",
            91 => "Республика Крым",
            92 => "Севастополь",
            93 => "Донецкая Народная Республика",
            94 => "Луганская Народная Республика",
            95 => "Херсонская область",
            99 => "Иные территории",
        ];


        /**
         * Почтовые индексы.
         * Исключения по неизвестным причинам:
         * Агинский Бурятский округ
         * Усть-Ордынский Бурятский округ
         * Корякский автономный округ
         * Таймырский Долгано-Ненецкий район
         * Эвенкийский район
         * Коми-Пермяцкий округ
         * @var array|\int[][]
         */
        private array $postal_code = [
            'Республика Адыгея' => [ 0 => 385, ],
            'Республика Алтай' => [ 0 => 649, ],
            'Алтайский край' => [ 0 => 656, 1 => 657, 2 => 658, 3 => 659, ],
            'Амурская область' => [ 0 => 675, 1 => 676, ],
            'Архангельская область' => [ 0 => 163, 1 => 164, 2 => 165, ],
            'Астраханская область' => [ 0 => 414, 1 => 415, 2 => 416, ],
            'Республика Башкортостан' => [ 0 => 450, 1 => 451, 2 => 452, 3 => 453, ],
            'Белгородская область' => [ 0 => 308, 1 => 309, ],
            'Брянская область' => [ 0 => 241, 1 => 242, 2 => 243, ],
            'Республика Бурятия' => [ 0 => 670, 1 => 671, ],
            'Владимирская область' => [ 0 => 600, 1 => 601, 2 => 602, ],
            'Волгоградская область' => [ 0 => 400, 1 => 401, 2 => 402, 3 => 403, 4 => 404, ],
            'Вологодская область' => [ 0 => 160, 1 => 161, 2 => 162, ],
            'Воронежская область' => [ 0 => 394, 1 => 395, 2 => 396, 3 => 397, ],
            'Республика Дагестан' => [ 0 => 367, 1 => 368, ],
            'Донецкая Народная Республика' => [ 0 => 283, 1 => 284, 2 => 285, 3 => 286, 4 => 287, ],
            'Еврейская авт. область' => [ 0 => 679, ],
            'Забайкальский край' => [ 0 => 672, 1 => 673, 2 => 674, ],
            'Агинский Бурятский округ' => [ 0 => 687, ],
            'Запорожская область' => [ 0 => 269, 1 => 270, 2 => 271, 3 => 272, ],
            'Ивановская область' => [ 0 => 153, 1 => 154, 2 => 155, ],
            'Республика Ингушетия' => [ 0 => 386, ],
            'Иркутская область' => [ 0 => 664, 1 => 665, 2 => 666, ],
            'Усть-Ордынский Бурятский округ' => [ 0 => 669, ],
            'Кабардино-Балкарская Республика' => [ 0 => 360, 1 => 361, ],
            'Калининградская область' => [ 0 => 236, 1 => 237, 2 => 238, ],
            'Республика Калмыкия' => [ 0 => 358, 1 => 359, ],
            'Калужская область' => [ 0 => 248, 1 => 249, ],
            'Камчатский край' => [ 0 => 683, 1 => 684, ],
            'Корякский автономный округ' => [ 0 => 688, ],
            'Карачаево-Черкесская Республика' => [ 0 => 369, ],
            'Республика Карелия' => [ 0 => 185, 1 => 186, ],
            'Кемеровская область' => [ 0 => 650, 1 => 651, 2 => 652, 3 => 653, 4 => 654, ],
            'Кировская область' => [ 0 => 610, 1 => 611, 2 => 612, 3 => 613, ],
            'Республика Коми' => [ 0 => 167, 1 => 168, 2 => 169, ],
            'Костромская область' => [ 0 => 156, 1 => 157, ],
            'Краснодарский край' => [ 0 => 350, 1 => 351, 2 => 352, 3 => 353, 4 => 354, ],
            'Красноярский край' => [ 0 => 660, 1 => 661, 2 => 662, 3 => 663, ],
            'Таймырский Долгано-Ненецкий район' => [ 0 => 647, ],
            'Эвенкийский район' => [ 0 => 648, ],
            'Республика Крым' => [ 0 => 295, 1 => 296, 2 => 297, 3 => 298, ],
            'Курганская область' => [ 0 => 640, 1 => 641, ],
            'Курская область' => [ 0 => 305, 1 => 306, 2 => 307, ],
            'Ленинградская область' => [ 0 => 187, 1 => 188, ],
            'Липецкая область' => [ 0 => 398, 1 => 399, ],
            'Луганская Народная Республика' => [ 0 => 291, 1 => 292, 2 => 293, 3 => 294, ],
            'Магаданская область' => [ 0 => 685, 1 => 686, ],
            'Республика Марий Эл' => [ 0 => 424, 1 => 425, ],
            'Республика Мордовия' => [ 0 => 430, 1 => 431, ],
            'Москва' => [ 0 => 101, 1 => 102, 2 => 103, 3 => 104, 4 => 105, 5 => 106, 6 => 107, 7 => 108, 8 => 109, 9 => 110, 10 => 111, 11 => 112, 12 => 113, 13 => 114, 14 => 115, 15 => 116, 16 => 117, 17 => 118, 18 => 119, 19 => 120, 20 => 121, 21 => 122, 22 => 123, 23 => 124, 24 => 125, 25 => 126, 26 => 127, 27 => 128, 28 => 129, 29 => 130, 30 => 131, 31 => 132, 32 => 133, 33 => 134, 34 => 135, ],
            'Московская область' => [ 0 => 140, 1 => 141, 2 => 142, 3 => 143, 4 => 144, ],
            'Мурманская область' => [ 0 => 183, 1 => 184, ],
            'Ненецкий автономный округ' => [ 0 => 166, ],
            'Нижегородская область' => [ 0 => 603, 1 => 604, 2 => 605, 3 => 606, 4 => 607, ],
            'Новгородская область' => [ 0 => 173, 1 => 174, 2 => 175, ],
            'Новосибирская область' => [ 0 => 630, 1 => 631, 2 => 632, 3 => 633, ],
            'Омская область' => [ 0 => 644, 1 => 645, 2 => 646, ],
            'Оренбургская область' => [ 0 => 460, 1 => 461, 2 => 462, ],
            'Орловская область' => [ 0 => 302, 1 => 303, ],
            'Пензенская область' => [ 0 => 440, 1 => 441, 2 => 442, ],
            'Пермский край' => [ 0 => 614, 1 => 615, 2 => 616, 3 => 617, 4 => 618, ],
            'Коми-Пермяцкий округ' => [ 0 => 619, ],
            'Приморский край' => [ 0 => 690, 1 => 691, 2 => 692, ],
            'Псковская область' => [ 0 => 180, 1 => 181, 2 => 182, ],
            'Ростовская область' => [ 0 => 344, 1 => 345, 2 => 346, 3 => 347, ],
            'Рязанская область' => [ 0 => 390, 1 => 391, ],
            'Самарская область' => [ 0 => 443, 1 => 444, 2 => 445, 3 => 446, ],
            'Санкт-Петербург' => [ 0 => 190, 1 => 191, 2 => 192, 3 => 193, 4 => 194, 5 => 195, 6 => 196, 7 => 197, 8 => 198, 9 => 199, ],
            'Саратовская область' => [ 0 => 410, 1 => 411, 2 => 412, 3 => 413, ],
            'Республика Саха [Якутия]' => [ 0 => 677, 1 => 678, ],
            'Сахалинская область' => [ 0 => 693, 1 => 694, ],
            'Свердловская область' => [ 0 => 620, 1 => 621, 2 => 622, 3 => 623, 4 => 624, ],
            'Севастополь' => [ 0 => 299, ],
            'Северная Осетия' => [ 0 => 362, 1 => 363, ],
            'Смоленская область' => [ 0 => 214, 1 => 215, 2 => 216, ],
            'Ставропольский край' => [ 0 => 355, 1 => 356, 2 => 357, ],
            'Тамбовская область' => [ 0 => 392, 1 => 393, ],
            'Республика Татарстан' => [ 0 => 420, 1 => 421, 2 => 422, 3 => 423, ],
            'Тверская область' => [ 0 => 170, 1 => 171, 2 => 172, ],
            'Томская область' => [ 0 => 634, 1 => 635, 2 => 636, ],
            'Тульская область' => [ 0 => 300, 1 => 301, ],
            'Республика Тыва' => [ 0 => 667, 1 => 668, ],
            'Тюменская область' => [ 0 => 625, 1 => 626, 2 => 627, ],
            'Удмуртская Республика' => [ 0 => 426, 1 => 427, ],
            'Ульяновская область' => [ 0 => 432, 1 => 433, ],
            'Хабаровский край' => [ 0 => 680, 1 => 681, 2 => 682, ],
            'Республика Хакасия' => [ 0 => 655, ],
            'Ханты-Мансийский автономный округ' => [ 0 => 628, ],
            'Херсонская область' => [ 0 => 273, 1 => 274, 2 => 275, ],
            'Челябинская область' => [ 0 => 454, 1 => 455, 2 => 456, 3 => 457, ],
            'Чеченская Республика' => [ 0 => 364, 1 => 365, 2 => 366, ],
            'Чувашская Республика' => [ 0 => 428, 1 => 429, ],
            'Чукотский автономный округ' => [ 0 => 689, ],
            'Ямало-Ненецкий автономный округ' => [ 0 => 629, ],
            'Ярославская область' => [ 0 => 150, 1 => 151, 2 => 152, ],
            'Иные территории' => [ 0 => 800, ],
        ];

        /**
         * Создание экземпляра класса.
         * @return static
         */
        public static function get(): static
        {
            return new static();
        }

        public function sortName(): static
        {
            $this->regions = Arr::sort($this->regions);
            return $this;
        }

        public function sortNumber(): static
        {
            $this->regions = Arr::sortRecursive($this->regions);
            return $this;
        }

        public function withNumber(): static
        {
            $this->regions = Arr::map($this->regions, function (string $value, string $key) {
                return $key . ' - ' . $value;
            });
            return $this;
        }

        /**
         * Получить массив кодов регионов.
         * @return array|string[]
         */
        public function all(): array
        {
            return $this->regions;
        }

        /**
         * Получить название региона по коду.
         * @param $number
         * @return string
         */
        public function one($number): string
        {
            return $this->regions[(int)$number] ?? '';
        }

        /**
         * Возвращает код региона по 6-значному почтовому индексу.
         * @param int $code
         * @return int
         */
        public function postalCode(int $code): int
        {
            $code = intdiv($code, 1000);
            foreach ($this->postal_code as $region => $codes) {
                if(in_array($code, $codes)){
                    $found = $region;
                    break;
                }
            }
            return (int) array_search($found ?? 0, $this->regions);
        }
    }
}
